# Missing Values

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan],'B':[4,np.nan,6],'C':[7,8,9]}

In [3]:
d

{'A': [1, 2, nan], 'B': [4, nan, 6], 'C': [7, 8, 9]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  6.0  9

## Dropping Null values

In [6]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [7]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  6.0  9

In [9]:
df.dropna(thresh=3)

     A    B  C
0  1.0  4.0  7

## Filling missing values

In [12]:
df.fillna(value='New Value')

           A          B  C
0          1          4  7
1          2  New Value  8
2  New Value          6  9

### Filling with mean values

In [14]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64